public class Main {
    public static void main(String[] args) {

     /*
    Задача 1
Объявите три массива:
Целочисленный массив, заполненный тремя цифрами — 1, 2 и 3 — с помощью ключевого слова
new
Массив, в котором можно хранить три дробных числа — 1.57, 7.654, 9.986.
 Массив сразу заполните значениями.
Произвольный массив. Тип и количество данных определите сами. Самостоятельно выберите способ создания массива:
с помощью ключевого слова или сразу заполненный элементами.
.
     */
        System.out.println(" Задача № 1");
        int[] massiv = new int[]{1, 2, 3};
        double[] drob = new double[]{1.57, 7.654, 9.986};
        int[] maska = {4, 5, 6};
        int[] morcovka = new int[3];
        morcovka[0] = 7;
        morcovka[1] = 8;
        morcovka[2] = 9;


    }
    }



